espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/silabs/gecko_sdk/platform/Device/SiliconLabs/EFR32BG24/Include/efr32bg24_emu.h
/* Bit fields for EMU DGIEN */
#define _EMU_DGIEN_RESETVALUE                           0x00000000UL                               /**< Default value for EMU_DGIEN                 */
#define _EMU_DGIEN_MASK                                 0xE1000000UL                               /**< Mask for EMU_DGIEN                          */
#define EMU_DGIEN_EM23WAKEUPDGIEN                       (0x1UL << 24)                              /**< EM23 Wake up Interrupt enable               */
#define _EMU_DGIEN_EM23WAKEUPDGIEN_SHIFT                24                                         /**< Shift value for EMU_EM23WAKEUPDGIEN         */
#define _EMU_DGIEN_EM23WAKEUPDGIEN_MASK                 0x1000000UL                                /**< Bit mask for EMU_EM23WAKEUPDGIEN            */
#define _EMU_DGIEN_EM23WAKEUPDGIEN_DEFAULT              0x00000000UL                               /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_EM23WAKEUPDGIEN_DEFAULT               (_EMU_DGIEN_EM23WAKEUPDGIEN_DEFAULT << 24) /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMPDGIEN                             (0x1UL << 29)                              /**< Temperature Interrupt enable                */
#define _EMU_DGIEN_TEMPDGIEN_SHIFT                      29                                         /**< Shift value for EMU_TEMPDGIEN               */
#define _EMU_DGIEN_TEMPDGIEN_MASK                       0x20000000UL                               /**< Bit mask for EMU_TEMPDGIEN                  */
#define _EMU_DGIEN_TEMPDGIEN_DEFAULT                    0x00000000UL                               /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMPDGIEN_DEFAULT                     (_EMU_DGIEN_TEMPDGIEN_DEFAULT << 29)       /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMPLOWDGIEN                          (0x1UL << 30)                              /**< Temperature low Interrupt enable            */
#define _EMU_DGIEN_TEMPLOWDGIEN_SHIFT                   30                                         /**< Shift value for EMU_TEMPLOWDGIEN            */
#define _EMU_DGIEN_TEMPLOWDGIEN_MASK                    0x40000000UL                               /**< Bit mask for EMU_TEMPLOWDGIEN               */
#define _EMU_DGIEN_TEMPLOWDGIEN_DEFAULT                 0x00000000UL                               /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMPLOWDGIEN_DEFAULT                  (_EMU_DGIEN_TEMPLOWDGIEN_DEFAULT << 30)    /**< Shifted mode DEFAULT for EMU_DGIEN          */
#define EMU_DGIEN_TEMPHIGHDGIEN                         (0x1UL << 31)                              /**< Temperature high Interrupt enable           */
#define _EMU_DGIEN_TEMPHIGHDGIEN_SHIFT                  31                                         /**< Shift value for EMU_TEMPHIGHDGIEN           */
#define _EMU_DGIEN_TEMPHIGHDGIEN_MASK                   0x80000000UL                               /**< Bit mask for EMU_TEMPHIGHDGIEN              */
#define _EMU_DGIEN_TEMPHIGHDGIEN_DEFAULT                0x00000000UL                               /**< Mode DEFAULT for EMU_DGIEN                  */
#define EMU_DGIEN_TEMPHIGHDGIEN_DEFAULT                 (_EMU_DGIEN_TEMPHIGHDGIEN_DEFAULT << 31)   /**< Shifted mode DEFAULT for EMU_DGIEN          */

/* Bit fields for EMU SEQIF */
#define _EMU_SEQIF_RESETVALUE                           0x00000000UL                        /**< Default value for EMU_SEQIF                 */
#define _EMU_SEQIF_MASK                                 0xE0000000UL                        /**< Mask for EMU_SEQIF                          */
#define EMU_SEQIF_TEMP                                  (0x1UL << 29)                       /**< Temperature Interrupt flag                  */
#define _EMU_SEQIF_TEMP_SHIFT                           29                                  /**< Shift value for EMU_TEMP                    */
#define _EMU_SEQIF_TEMP_MASK                            0x20000000UL                        /**< Bit mask for EMU_TEMP                       */
#define _EMU_SEQIF_TEMP_DEFAULT                         0x00000000UL                        /**< Mode DEFAULT for EMU_SEQIF                  */
#define EMU_SEQIF_TEMP_DEFAULT                          (_EMU_SEQIF_TEMP_DEFAULT << 29)     /**< Shifted mode DEFAULT for EMU_SEQIF          */
#define EMU_SEQIF_TEMPLOW                               (0x1UL << 30)                       /**< Temperature low Interrupt flag              */
#define _EMU_SEQIF_TEMPLOW_SHIFT                        30                                  /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_SEQIF_TEMPLOW_MASK                         0x40000000UL                        /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_SEQIF_TEMPLOW_DEFAULT                      0x00000000UL                        /**< Mode DEFAULT for EMU_SEQIF                  */
#define EMU_SEQIF_TEMPLOW_DEFAULT                       (_EMU_SEQIF_TEMPLOW_DEFAULT << 30)  /**< Shifted mode DEFAULT for EMU_SEQIF          */
#define EMU_SEQIF_TEMPHIGH                              (0x1UL << 31)                       /**< Temperature high Interrupt flag             */
#define _EMU_SEQIF_TEMPHIGH_SHIFT                       31                                  /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_SEQIF_TEMPHIGH_MASK                        0x80000000UL                        /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_SEQIF_TEMPHIGH_DEFAULT                     0x00000000UL                        /**< Mode DEFAULT for EMU_SEQIF                  */
#define EMU_SEQIF_TEMPHIGH_DEFAULT                      (_EMU_SEQIF_TEMPHIGH_DEFAULT << 31) /**< Shifted mode DEFAULT for EMU_SEQIF          */

/* Bit fields for EMU SEQIEN */
#define _EMU_SEQIEN_RESETVALUE                          0x00000000UL                         /**< Default value for EMU_SEQIEN                */
#define _EMU_SEQIEN_MASK                                0xE0000000UL                         /**< Mask for EMU_SEQIEN                         */
#define EMU_SEQIEN_TEMP                                 (0x1UL << 29)                        /**< Temperature Interrupt enable                */
#define _EMU_SEQIEN_TEMP_SHIFT                          29                                   /**< Shift value for EMU_TEMP                    */
#define _EMU_SEQIEN_TEMP_MASK                           0x20000000UL                         /**< Bit mask for EMU_TEMP                       */
#define _EMU_SEQIEN_TEMP_DEFAULT                        0x00000000UL                         /**< Mode DEFAULT for EMU_SEQIEN                 */
#define EMU_SEQIEN_TEMP_DEFAULT                         (_EMU_SEQIEN_TEMP_DEFAULT << 29)     /**< Shifted mode DEFAULT for EMU_SEQIEN         */
#define EMU_SEQIEN_TEMPLOW                              (0x1UL << 30)                        /**< Temperature low Interrupt enable            */
#define _EMU_SEQIEN_TEMPLOW_SHIFT                       30                                   /**< Shift value for EMU_TEMPLOW                 */
#define _EMU_SEQIEN_TEMPLOW_MASK                        0x40000000UL                         /**< Bit mask for EMU_TEMPLOW                    */
#define _EMU_SEQIEN_TEMPLOW_DEFAULT                     0x00000000UL                         /**< Mode DEFAULT for EMU_SEQIEN                 */
#define EMU_SEQIEN_TEMPLOW_DEFAULT                      (_EMU_SEQIEN_TEMPLOW_DEFAULT << 30)  /**< Shifted mode DEFAULT for EMU_SEQIEN         */
#define EMU_SEQIEN_TEMPHIGH                             (0x1UL << 31)                        /**< Temperature high Interrupt enable           */
#define _EMU_SEQIEN_TEMPHIGH_SHIFT                      31                                   /**< Shift value for EMU_TEMPHIGH                */
#define _EMU_SEQIEN_TEMPHIGH_MASK                       0x80000000UL                         /**< Bit mask for EMU_TEMPHIGH                   */
#define _EMU_SEQIEN_TEMPHIGH_DEFAULT                    0x00000000UL                         /**< Mode DEFAULT for EMU_SEQIEN                 */
#define EMU_SEQIEN_TEMPHIGH_DEFAULT                     (_EMU_SEQIEN_TEMPHIGH_DEFAULT << 31) /**< Shifted mode DEFAULT for EMU_SEQIEN         */

/* Bit fields for EMU EFPIF */
#define _EMU_EFPIF_RESETVALUE                           0x00000000UL                    /**< Default value for EMU_EFPIF                 */
#define _EMU_EFPIF_MASK                                 0x00000001UL                    /**< Mask for EMU_EFPIF                          */
#define EMU_EFPIF_EFPIF                                 (0x1UL << 0)                    /**< EFP Interrupt Flag                          */
#define _EMU_EFPIF_EFPIF_SHIFT                          0                               /**< Shift value for EMU_EFPIF                   */
#define _EMU_EFPIF_EFPIF_MASK                           0x1UL                           /**< Bit mask for EMU_EFPIF                      */
#define _EMU_EFPIF_EFPIF_DEFAULT                        0x00000000UL                    /**< Mode DEFAULT for EMU_EFPIF                  */
#define EMU_EFPIF_EFPIF_DEFAULT                         (_EMU_EFPIF_EFPIF_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_EFPIF          */

/* Bit fields for EMU EFPIEN */
#define _EMU_EFPIEN_RESETVALUE                          0x00000000UL                      /**< Default value for EMU_EFPIEN                */
#define _EMU_EFPIEN_MASK                                0x00000001UL                      /**< Mask for EMU_EFPIEN                         */
#define EMU_EFPIEN_EFPIEN                               (0x1UL << 0)                      /**< EFP Interrupt enable                        */
#define _EMU_EFPIEN_EFPIEN_SHIFT                        0                                 /**< Shift value for EMU_EFPIEN                  */
#define _EMU_EFPIEN_EFPIEN_MASK                         0x1UL                             /**< Bit mask for EMU_EFPIEN                     */
#define _EMU_EFPIEN_EFPIEN_DEFAULT                      0x00000000UL                      /**< Mode DEFAULT for EMU_EFPIEN                 */
#define EMU_EFPIEN_EFPIEN_DEFAULT                       (_EMU_EFPIEN_EFPIEN_DEFAULT << 0) /**< Shifted mode DEFAULT for EMU_EFPIEN         */

/** @} End of group EFR32BG24_EMU_BitFields */
/** @} End of group EFR32BG24_EMU */
/** @} End of group Parts */

#endif /* EFR32BG24_EMU_H */
